# Subselects

In [1]:
%load_ext sql

In [2]:
%sql mysql://steinam:steinam@localhost/sommer_2015

'Connected: steinam@sommer_2015'

## Sommer 2015

### Datenmodell

![Datenmodell](../figure/sommer_2015_datenmodell.png)

### Aufgabe

Erstellen Sie eine Abfrage, mit der Sie die Daten aller Kunden, die Anzahl deren Aufträge, die Anzahl der Fahrten und die Summe der Streckenkilometer erhalten. Die Ausgabe soll nach Kunden-PLZ absteigend sortiert sein.



![Ausgabe](sommer_2015_hs5_d.png)

### Lösung

```mysql
select k.kd_id, 
	(select count(a.Au_ID) from auftrag  a 
		where a.au_kd_id = k.kd_id ) as AnzahlAuftr,
	(select count(f.`f_id`) from fahrten  f, auftrag a
		where f.f_au_id = a.au_id and a.`au_kd_id` = k.`kd_id`) as AnzahlFahrt,
	(select sum(ts.ts_strecke) from teilstrecke ts, fahrten f, auftrag a
		where ts.ts_f_id = f.f_id and a.au_id = f.`f_au_id` and a.`au_kd_id` = k.`kd_id`) as SumStrecke
from kunde k
order by k.kd_plz;
```

In [3]:
%%sql 
select k.kd_id, k.kd_plz, 
    (select count(a.Au_ID) from auftrag a where a.au_kd_id = k.kd_id ) as AnzahlAuftr,
    (select count(f.`f_id`) from fahrten f, auftrag a 
         where f.f_au_id = a.au_id and a.`au_kd_id` = k.`kd_id`) as AnzahlFahrt, 
    (select sum(ts.ts_strecke) from teilstrecke ts, fahrten f, auftrag a 
         where ts.ts_f_id = f.f_id and a.au_id = f.`f_au_id` and a.`au_kd_id` = k.`kd_id`) as SumStrecke 
from kunde k order by k.kd_plz;

3 rows affected.

[(1, None, 2, 7, Decimal('3199')),
 (2, None, 0, 0, None),
 (3, None, 1, 0, None)]

In [26]:
%sql select count(*) as AnzahlFahrten from fahrten

1 rows affected.

[(7,)]

Warum geht kein Join ??

```mysql
select k.kd_id, k.`kd_firma`, k.`kd_plz`, 
        count(a.Au_ID) as AnzAuftrag, 
        count(f.f_id) as AnzFahrt, 
        sum(ts.ts_strecke) as SumStrecke
from kunde k left join auftrag a
	on k.`kd_id` = a.`au_kd_id`
left join fahrten f
	on a.`au_id` = f.`f_au_id`
left join teilstrecke ts
	on ts.`ts_f_id` = f.`f_id`
group by k.kd_id	
order by k.`kd_plz`
```

In [6]:
%%sql 
select k.kd_id, k.`kd_firma`, k.`kd_plz`, 
        count(distinct a.Au_ID) as AnzAuftrag, 
        count(distinct f.f_id) as AnzFahrt, 
        sum(ts.ts_strecke) as SumStrecke
from kunde k left join auftrag a
    on k.`kd_id` = a.`au_kd_id`
left join fahrten f
    on a.`au_id` = f.`f_au_id`
left join teilstrecke ts
    on ts.`ts_f_id` = f.`f_id`
group by k.kd_id    
order by k.`kd_plz`

3 rows affected.

[(2, 'Öhlandi', None, 0, 0, None),
 (1, 'Trapo', None, 2, 7, Decimal('3199')),
 (3, 'Müller', None, 1, 0, None)]

Der Ansatz mit Join funktioniert in dieser Form nicht, da spätestens beim 2. Join die Firma Trappo mit 2 Datensätzen aus dem 1. Join verknüpft wird. Deshalb wird auch die Anzahl der Fahren verdoppelt. Dies wiederholt sich beim 3. Join.

Die folgende Abfrage zeigt ohne die Aggregatfunktionen das jeweilige Ausgangsergebnis


```mysql
select k.kd_id, k.`kd_firma`, k.`kd_plz`, a.`au_id`
from kunde k left join auftrag a
	on k.`kd_id` = a.`au_kd_id`
left join fahrten f
	on a.`au_id` = f.`f_au_id`
left join teilstrecke ts
	on ts.`ts_f_id` = f.`f_id`
order by k.`kd_plz`
```

In [8]:
%%sql
SELECT kunde.Kd_ID, kunde.Kd_Firma, kunde.Kd_Strasse, kunde.Kd_PLZ, 
kunde.Kd_Ort, COUNT(distinct auftrag.Au_ID) AS AnzahlAuftr, COUNT(distinct fahrten.F_ID) AS AnzahlFahrt, SUM(teilstrecke.Ts_Strecke) AS SumStrecke
FROM kunde
LEFT JOIN auftrag ON auftrag.Au_Kd_ID = kunde.Kd_ID
LEFT JOIN fahrten ON fahrten.F_Au_ID = auftrag.Au_ID 
LEFT JOIN Teilstrecke ON teilstrecke.Ts_F_ID = fahrten.F_ID 
GROUP BY kunde.Kd_ID
ORDER BY kunde.Kd_PLZ desc;

3 rows affected.

[(3, 'Müller', None, None, None, 1, 0, None),
 (1, 'Trapo', None, None, None, 2, 7, Decimal('3199')),
 (2, 'Öhlandi', None, None, None, 0, 0, None)]

## Winter 2015

### Datenmodell

![Datenmodell](winter_2015_datenmodell.png)

Hinweis: In Rechnung gibt es zusätzlich ein Feld Rechnung.Kd_ID

### Aufgabe

Erstellen Sie eine SQL-Abfrage, mit der alle Kunden wie folgt aufgelistet werden, bei denen eine Zahlungsbedingung mit einem Skontosatz größer 3 % ist, mit Ausgabe der Anzahl der hinterlegten Rechnungen aus dem Jahr 2015.

![Ausgabe](winter_2015_hs5_frage_b.png)

### Lösung

In [10]:
%sql mysql://steinam:steinam@localhost/winter_2015

'Connected: steinam@winter_2015'

```mysql
select count(rechnung.`Rg_ID`), kunde.`Kd_Name` 
	from rechnung inner join kunde
	on `rechnung`.`Rg_KD_ID` = kunde.`Kd_ID`
    inner join `zahlungsbedingung` 
    on kunde.`Kd_Zb_ID` = `zahlungsbedingung`.`Zb_ID`
    where `zahlungsbedingung`.`Zb_SkontoProzent` > 3.0
    	and year(`rechnung`.`Rg_Datum`) = 2015
group by Kunde.`Kd_Name`

```

In [11]:
%%sql 
select count(rechnung.`Rg_ID`), kunde.`Kd_Name`  from rechnung 
    inner join kunde on `rechnung`.`Rg_KD_ID` = kunde.`Kd_ID` 
        inner join `zahlungsbedingung`  on kunde.`Kd_Zb_ID` = `zahlungsbedingung`.`Zb_ID` 
        where `zahlungsbedingung`.`Zb_SkontoProzent` > 3.0 
        and year(`rechnung`.`Rg_Datum`) = 2015 group by Kunde.`Kd_Name`

2 rows affected.

[(4, 'Mustermann'), (2, 'Peters')]

Es geht auch mit einem Subselect

```mysql
    select kd.`Kd_Name`, 
        (select COUNT(*) from Rechnung as R
            where R.`Rg_KD_ID` = KD.`Kd_ID` and year(R.`Rg_Datum`) = 2015)
    
    from Kunde kd inner join `zahlungsbedingung` 
    on kd.`Kd_Zb_ID` = `zahlungsbedingung`.`Zb_ID`
   and `zahlungsbedingung`.`Zb_SkontoProzent` > 3.0

```

In [12]:
%%sql 
select kd.`Kd_Name`, 
(select COUNT(*) from Rechnung as R 
     where R.`Rg_KD_ID` = KD.`Kd_ID` and year(R.`Rg_Datum`) = 2015) as Anzahl
from Kunde kd inner join `zahlungsbedingung`  
    on kd.`Kd_Zb_ID` = `zahlungsbedingung`.`Zb_ID` 
        and `zahlungsbedingung`.`Zb_SkontoProzent` > 3.0

2 rows affected.

[('Peters', 2), ('Mustermann', 4)]

In [13]:
%%sql
-- wortmann und prinz
select 
	(select count(rechnung.rg_id) from rechnung 
		where
			rechnung.rg_kd_id = kunde.kd_id
			and (select zb_skontoprozent from zahlungsbedingung where zahlungsbedingung.zb_id = kunde.kd_zb_id) > 3
			and YEAR(rechnung.rg_datum) = 2015
	) as AnzRechnungen,
	kunde.*
from kunde;

3 rows affected.

[(2, 'K002351', 'Peters', 1),
 (4, 'K006423', 'Mustermann', 1),
 (0, 'K007654', 'Hinkel', 3)]

In [14]:
%%sql
SELECT COUNT(r.rg_id) AS AnzRechnung, k.*
FROM kunde AS k
LEFT JOIN rechnung AS r ON k.kd_id = r.Rg_KD_ID
WHERE k.kd_zb_id IN 
    (SELECT zb_id FROM zahlungsbedingung WHERE zb_skontoprozent > 3) AND YEAR(r.Rg_Datum) = 2015
GROUP BY k.Kd_ID

2 rows affected.

[(2, 'K002351', 'Peters', 1), (4, 'K006423', 'Mustermann', 1)]

## Versicherung

Zeigen Sie zu jedem Mitarbeiter der Abteilung „Vertrieb“ den ersten Vertrag (mit einigen Angaben) an, den er abgeschlossen hat. Der Mitarbeiter soll mit ID und Name/Vorname angezeigt werden.

### Datenmodell Versicherung

![Versicherung](versicherung_ausschnitt.png)

In [65]:
%sql -- your code goes here

0 rows affected.

[]

### Lösung

In [2]:
%sql mysql://steinam:steinam@localhost/versicherung_complete

'Connected: steinam@versicherung_complete'

In [12]:
%%sql 
select min(`vv`.`Abschlussdatum`) as 'Erster Abschluss', `vv`.`Mitarbeiter_ID`
from `versicherungsvertrag` vv inner join mitarbeiter m 
    on vv.`Mitarbeiter_ID` = m.`ID`
where vv.`Mitarbeiter_ID` in ( select m.`ID` from mitarbeiter m 
    inner join Abteilung a
        on m.`Abteilung_ID` = a.`ID`) 
group by vv.`Mitarbeiter_ID`

2 rows affected.

[(datetime.date(1974, 5, 3), 9), (datetime.date(1974, 8, 7), 10)]

In [10]:
%%sql
-- rm
SELECT m.ID, m.Name, m.Vorname, v.*
FROM versicherungsvertrag AS v
JOIN mitarbeiter AS m ON m.ID = v.Mitarbeiter_ID
WHERE v.Abschlussdatum = (SELECT min(v.Abschlussdatum) 
               FROM versicherungsvertrag AS v WHERE v.Mitarbeiter_ID = m.ID 
               )
GROUP BY v.Mitarbeiter_ID

2 rows affected.

[(9, 'Pohl', 'Helmut', 1, 'DG-01', datetime.date(1974, 5, 3), 'TK', 9, 1, 1, Decimal('550'), 100, None),
 (10, 'Braun', 'Christian', 20, 'XC-01', datetime.date(1974, 8, 7), 'HP', 10, 4, 2, Decimal('500'), 100, None)]

In [8]:
%%sql
-- original
SELECT vv.ID as VV, vv.Vertragsnummer, vv.Abschlussdatum, vv.Art,
mi.ID as MI, mi.Name, mi.Vorname
from Versicherungsvertrag vv
right join ( select MIN(vv2.ID) as ID, vv2.Mitarbeiter_ID
from Versicherungsvertrag vv2
group by vv2.Mitarbeiter_id ) Temp
on Temp.ID = vv.ID
right join Mitarbeiter mi on mi.ID = vv.Mitarbeiter_ID
where mi.Abteilung_ID = ( select ID from Abteilung
where Bezeichnung = 'Vertrieb' );

4 rows affected.

[(1, 'DG-01', datetime.date(1974, 5, 3), 'TK', 9, 'Pohl', 'Helmut'),
 (4, 'DH-02', datetime.date(1990, 2, 1), 'HP', 10, 'Braun', 'Christian'),
 (None, None, None, None, 11, 'Polovic', 'Frantisek'),
 (None, None, None, None, 12, 'Kalman', 'Aydin')]

In [6]:
%%sql
-- rm
SELECT m.ID, m.Name, m.Vorname, v.*
FROM versicherungsvertrag AS v
JOIN mitarbeiter AS m ON m.ID = v.Mitarbeiter_ID
GROUP BY v.Mitarbeiter_ID
ORDER BY v.Abschlussdatum ASC

2 rows affected.

[(9, 'Pohl', 'Helmut', 1, 'DG-01', datetime.date(1974, 5, 3), 'TK', 9, 1, 1, Decimal('550'), 100, None),
 (10, 'Braun', 'Christian', 4, 'DH-02', datetime.date(1990, 2, 1), 'HP', 10, 12, 10, Decimal('500'), 100, None)]

In [15]:
%%sql
-- ruppert_hartmann

Select mitarbeiter.ID, mitarbeiter.Name, mitarbeiter.Vorname, 
			mitarbeiter.Personalnummer,
			abteilung.Bezeichnung, 
			min(versicherungsvertrag.abschlussdatum), 
            versicherungsvertrag.vertragsnummer
FROM mitarbeiter
LEFT JOIN abteilung ON Abteilung_ID = Abteilung.ID
LEFT JOIN versicherungsvertrag ON versicherungsvertrag.Mitarbeiter_ID = mitarbeiter.ID
WHERE abteilung.Bezeichnung = 'Vertrieb'
GROUP BY mitarbeiter.ID

4 rows affected.

[(9, 'Pohl', 'Helmut', '50001', 'Vertrieb', datetime.date(1974, 5, 3), 'DG-01'),
 (10, 'Braun', 'Christian', '50002', 'Vertrieb', datetime.date(1974, 8, 7), 'DH-02'),
 (11, 'Polovic', 'Frantisek', '50003', 'Vertrieb', None, None),
 (12, 'Kalman', 'Aydin', '50004', 'Vertrieb', None, None)]

In [59]:
result = _

In [60]:
result

[(datetime.date(1974, 5, 3), 9), (datetime.date(1974, 8, 7), 10)]